<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest versions of Reaper and ReaMote and imports them into Munki.</string>
	<key>Identifier</key>
	<string>uk.ac.bham.beast.autopkg.munki.Reaper</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Reaper</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>REAPER is a complete digital audio production application, offering a full multitrack audio and MIDI recording, editing, processing, mixing and mastering toolset.</string>
			<key>developer</key>
			<string>Cockos Incorporated</string>
			<key>display_name</key>
			<string>Reaper</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>uk.ac.bham.beast.autopkg.download.Reaper</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>munkiimport_appname</key>
				<string>REAPER.app</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
<!--		<dict>
			<key>Comment</key>
			<string>Second MunkiImporter for adding ReaMote to the repo</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>munkiimport_appname</key>
				<string>ReaMote.app</string>
				<key>pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>testing</string>
					</array>
					<key>description</key>
					<string>ReaMote is REAPER's network FX functionality.</string>
					<key>developer</key>
					<string>Cockos Incorporated</string>
					<key>display_name</key>
					<string>ReaMote</string>
					<key>name</key>
					<string>ReaMote</string>
					<key>unattended_install</key>
					<true/>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict> -->
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_repo_path%</string>
				<key>name</key>
				<string>ReaMote</string>
				<!-- <key>info_path</key>
				<string>apps/ReaMote</string> -->
			</dict>
			<key>Processor</key>
			<string>MunkiInfoCreator</string>
		</dict>
		<!-- <dict>
			<key>Arguments</key>
			<dict>
				<key>pkginfo</key>
				<string>%munki_info%</string>
				<key>additional_pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>testing</string>
					</array>
					<key>description</key>
					<string>ReaMote is REAPER's network FX functionality.</string>
					<key>developer</key>
					<string>Cockos Incorporated</string>
					<key>display_name</key>
					<string>ReaMote</string>
					<key>name</key>
					<string>ReaMote</string>
					<key>unattended_install</key>
					<true/>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.cockos.ReaMote</string>
							<key>CFBundleShortVersionString</key>
							<string>5.26.0</string>
							<key>CFBundleVersion</key>
							<string>5.26.0</string>
							<key>path</key>
							<string>/Applications/ReaMote.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
					</array>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>destination_path</key>
							<string>/Applications</string>
							<key>source_item</key>
							<string>ReaMote.app</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict> -->
	</array>
</dict>
</plist>
