<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by James Carpenter</string>
	<key>Description</key>
	<string>Downloads the latest version of the GRM Tools set specified in the input section</string>
	<key>Identifier</key>
	<string>com.github.orbsmiv.download.GrmToolsEvolution</string>
	<key>Input</key>
	<dict>
		<key>TOOLSET</key>
		<string>Classic</string>
		<key>DOWNLOAD_URL</key>
		<string>http://www.inagrm.com/grm-tools-download</string>
		<key>NAME</key>
		<string>GRM_Tools</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>re_pattern</key>
				<string>sites/default/files/download/GRM_Tools_%TOOLSET%.*\s+\((\d+\.\d+\.\d+)\)</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%_%TOOLSET%-%version%.zip</string>
				<key>url</key>
				<string>http://www.inagrm.com/sites/default/files/download/GRM_Tools_%TOOLSET%_Mac.mpkg.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
				<dict>
						<key>archive_path</key>
						<string>%pathname%</string>
						<key>purge_destination</key>
						<true/>
						<key>destination_path</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%_%TOOLSET%</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_%TOOLSET%/*.pkg</string>
				<key>expected_authority_names</key>
				<array>
						<string>Developer ID Installer: Institut National de l'Audiovisuel</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
