<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by James Carpenter</string>
	<key>Description</key>
	<string>Downloads the latest version of the GRM Tools set specified in the input section</string>
	<key>Identifier</key>
	<string>com.github.orbsmiv.munki.GrmToolsV3-spectralTransform</string>
	<key>Input</key>
	<dict>
		<key>TOOLSET</key>
		<string>ST</string>
		<key>NAME</key>
		<string>GRM_Tools</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%_%TOOLSET%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>GRM Tools. Installs standalone, AU and VST.</string>
			<key>developer</key>
			<string>Ina GRM</string>
			<key>display_name</key>
			<string>GRM Tools %TOOLSET%</string>
			<key>name</key>
			<string>%NAME%_%TOOLSET%</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.orbsmiv.download.GrmToolsV3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
					<key>installer_choices_xml</key>
					<array>
						<dict>
							<key>attributeSetting</key>
							<integer>1</integer>
							<key>choiceAttribute</key>
							<string>selected</string>
							<key>choiceIdentifier</key>
							<string>installer_choice_1</string>
						</dict>
						<dict>
							<key>attributeSetting</key>
							<integer>1</integer>
							<key>choiceAttribute</key>
							<string>selected</string>
							<key>choiceIdentifier</key>
							<string>installer_choice_2</string>
						</dict>
						<dict>
							<key>attributeSetting</key>
							<integer>1</integer>
							<key>choiceAttribute</key>
							<string>selected</string>
							<key>choiceIdentifier</key>
							<string>installer_choice_3</string>
						</dict>
						<dict>
							<key>attributeSetting</key>
							<integer>0</integer>
							<key>choiceAttribute</key>
							<string>selected</string>
							<key>choiceIdentifier</key>
							<string>installer_choice_4</string>
						</dict>
						<dict>
							<key>attributeSetting</key>
							<integer>0</integer>
							<key>choiceAttribute</key>
							<string>selected</string>
							<key>choiceIdentifier</key>
							<string>installer_choice_5</string>
						</dict>
						<dict>
							<key>attributeSetting</key>
							<integer>0</integer>
							<key>choiceAttribute</key>
							<string>selected</string>
							<key>choiceIdentifier</key>
							<string>installer_choice_6</string>
						</dict>
						<dict>
							<key>attributeSetting</key>
							<integer>0</integer>
							<key>choiceAttribute</key>
							<string>selected</string>
							<key>choiceIdentifier</key>
							<string>installer_choice_7</string>
						</dict>
					</array>
          <key>installs</key>
        	<array>
        		<dict>
        			<key>CFBundleVersion</key>
        			<string>%version%</string>
        			<key>path</key>
        			<string>/Library/Audio/Plug-Ins/VST/GRM/GRM Contrast.vst</string>
        			<key>type</key>
        			<string>bundle</string>
        			<key>version_comparison_key</key>
        			<string>CFBundleVersion</string>
        		</dict>
            <dict>
        			<key>CFBundleVersion</key>
        			<string>%version%</string>
        			<key>path</key>
        			<string>/Library/Audio/Plug-Ins/Components/GRM Contrast.component</string>
        			<key>type</key>
        			<string>bundle</string>
        			<key>version_comparison_key</key>
        			<string>CFBundleVersion</string>
        		</dict>
            <dict>
        			<key>CFBundleIdentifier</key>
        			<string>com.grm.ContrastApp</string>
        			<key>CFBundleVersion</key>
        			<string>%version%</string>
        			<key>path</key>
        			<string>/Applications/GRM/GRM Contrast.app</string>
        			<key>type</key>
        			<string>application</string>
        			<key>version_comparison_key</key>
        			<string>CFBundleVersion</string>
        		</dict>
        	</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
    <dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_%TOOLSET%/*.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
