<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Pd and creates a package. This is necessary whist Pd doesn't correctly update its CFBundleVersion string.</string>
	<key>Identifier</key>
	<string>com.github.orbsmiv.pkg.Pd</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Pd</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.orbsmiv.download.Pd</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Pd*.app</string>
			</dict>
		</dict>
		<dict>
    	<key>Comment</key>
    	<string>Rename the app to Pd, removing version information.</string>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%found_filename%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Pd.app</string>
			</dict>
		</dict>
		<dict>
    	<key>Comment</key>
    	<string>The version string from the Pd download contains a "-" character that we want to replace with a "."</string>
			<key>Arguments</key>
			<dict>
        <key>find</key>
        <string>-</string>
        <key>input_string</key>
        <string>%versionstring%</string>
        <key>replace</key>
        <string>.</string>
      </dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
		</dict>
    <dict>
			<key>Arguments</key>
			<dict>
        <key>pkg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        <key>app_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Pd.app</string>
        <key>version</key>
        <string>%output_string%</string>
        <key>force_pkg_build</key>
        <false/>
      </dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
    </dict>
	</array>
</dict>
</plist>
