<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by James Carpenter</string>
	<key>Description</key>
	<string>Imports Reaper SWS plugins into Munki.</string>
	<key>Identifier</key>
	<string>uk.ac.bham.beast.autopkg.munki.ReaperSWS</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ReaperSWS</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A collection of features that seamlessly integrate into REAPER.</string>
			<key>developer</key>
			<string>Standing Water Studios</string>
			<key>display_name</key>
			<string>Reaper SWS Plugins</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>uk.ac.bham.beast.autopkg.download.ReaperSWS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/root/Library/Application Support/REAPER/UserPlugins</string>
				<key>source_path</key>
				<string>%pathname%/</string>
				<key>overwrite</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>Copy files from DMG to obtain a hash of the file.</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/unpack/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Library/Application Support/REAPER/UserPlugins/reaper_sws_extension.dylib</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Use processor to obtain hash.</string>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Merge installs dict.</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>items_to_copy</key>
						<array>
							<dict>
								<key>source_item</key>
								<string>reaper_sws_extension.dylib</string>
								<key>destination_path</key>
								<string>/Library/Application Support/REAPER/UserPlugins</string>
								<key>version</key>
								<string>%version%</string>
								<key>installer_type</key>
								<string>copy_from_dmg</string>
							</dict>
						</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
