<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by James Carpenter</string>
	<key>Description</key>
	<string>Creates a package for the Reaper SWS plugins.</string>
	<key>Identifier</key>
	<string>com.github.orbsmiv.pkg.ReaperSWS</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ReaperSWS</string>
		<key>BUNDLE_ID</key>
		<string>org.sws-extension.reaper</string>
		<key>ARCH</key>
		<string>x86_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.orbsmiv.download.ReaperSWS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0755</string>
					<key>Library/Application Support</key>
					<string>0775</string>
					<key>Library/Application Support/REAPER</key>
					<string>0775</string>
					<key>Library/Application Support/REAPER/UserPlugins</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/reaper_sws-%ARCH%.dylib</string>
				<key>destination_path</key>
				<string>%pkgroot%/Library/Application Support/REAPER/UserPlugins/reaper_sws-%ARCH%.dylib</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>id</key>
					<string>%BUNDLE_ID%</string>
					<key>version</key>
					<string>%version%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Comment</key>
			<string>Clean-up working directory.</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<string>%pkgroot%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
