<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of AudioSculpt.</string>
	<key>Identifier</key>
	<string>com.github.orbsmiv.download.AudioSculpt</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>http://forumnet.ircam.fr/shop/en/forumnet/10-audiosculpt.html</string>
		<key>NAME</key>
		<string>AudioSculpt</string>
    <key>AUTH_COOKIE</key>
		<string>enter_cookies_here</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>http://forumnet.ircam.fr/shop/en/get-file.php\?id=\d+</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>request_headers</key>
				<dict>
					<key>Cookie</key>
					<string>%AUTH_COOKIE%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
				<key>request_headers</key>
				<dict>
					<key>Cookie</key>
					<string>%AUTH_COOKIE%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
