<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Written by James Carpenter</string>
		<key>Description</key>
		<string>Downloads the latest versions of MOTU AVB driver and MOTU Audio Tools and imports them into Munki.</string>
		<key>Identifier</key>
		<string>com.github.orbsmiv.pkg.MotuProAudio</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>MotuProAudio</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>ParentRecipe</key>
		<string>com.github.orbsmiv.download.MotuProAudio</string>
		<key>Process</key>
		<array>
			<!-- <dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/MOTU Pro Audio Installer for Mac/*.pkg</string>
				</dict>
			</dict> -->
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>purge_destination</key>
					<true/>
					<key>flat_pkg_path</key>
					<string>%found_filename%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/MOTU_Pro_Audio_Drivers.pkg/payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>purge_destination</key>
					<false/>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/MOTU Discovery.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack/MOTU_Pro_Audio_Drivers.pkg/Scripts/postinstall</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Comment</key>
				<string>Rewrite the postinstall to remove the command that opens the MOTU Discovery App</string>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/MOTU_Pro_Audio_Drivers.pkg/Scripts/postinstall</string>
					<key>file_mode</key>
					<string>0755</string>
					<key>file_content</key>
					<string>#! /bin/sh

#
#    After installing FireWire kexts, make sure the owner and permissions are correct,
#    and touch /System/Library/Extensions so the system will know there are new kexts.
#
#    This script is run by the audio installer.
#
#    Created 3/21/2012 by Mark S. Wachsler
#    Copyright (c) 2012-2013, Mark of the Unicorn, Inc.
#
KEXT="MOTUProAudio.kext"

# 10.9+ install kext in /Library/Extensions
cd /Library/Extensions
chown -R root:wheel $KEXT
chmod -R u=rw,go=r,+X $KEXT
touch .

# if we're in 10.8, move the kext to /System
OSVER=`sw_vers | grep 'ProductVersion:' | grep -o '[0-9]*\.[0-9]*\.[0-9]*'`
if [[ $OSVER =~ ^10\.8\. ]]
then
  mv /Library/Extensions/$KEXT /System/Library/Extensions/$KEXT
  touch /System/Library/Extensions/
fi

# load our http server daemon
/bin/launchctl load /Library/LaunchDaemons/com.motu.proaudio.HTTPServer.launchd.plist

# restart coreaudiod
/bin/launchctl unload /System/Library/LaunchDaemons/com.apple.audio.coreaudiod.plist
/bin/launchctl load /System/Library/LaunchDaemons/com.apple.audio.coreaudiod.plist

# open the discovery app
# open "/Applications/MOTU Discovery.app"</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FlatPkgPacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_pkg</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
					<key>source_flatpkg_dir</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Comment</key>
				<string>Tidy-up unpacked contents.</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
						<string>%RECIPE_CACHE_DIR%/payload</string>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
