<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Written by James Carpenter</string>
		<key>Description</key>
		<string>Downloads the latest versions of MOTU AVB driver and MOTU Audio Tools and imports them into Munki.</string>
		<key>Identifier</key>
		<string>com.github.orbsmiv.munki.MotuProAudio</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>MotuProAudio</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Includes MOTU Discovery (for AVB interfaces), MOTU Audio Tools (for signal analysis) and Thunderbolt/USB drivers.</string>
				<key>developer</key>
				<string>MOTU</string>
				<key>display_name</key>
				<string>MOTU Pro Audio</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>preinstall_script</key>
				<string>#!/bin/sh

OLD_MOTU_AGENT_PATH="/Library/LaunchAgents/com.motu.MOTUDiscoveryApp.plist"

if [ -f "${OLD_MOTU_AGENT_PATH}" ]; then
  /bin/launchctl unload "${OLD_MOTU_AGENT_PATH}"
  /bin/rm -f "${OLD_MOTU_AGENT_PATH}"
fi

exit 0</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>ParentRecipe</key>
		<string>com.github.orbsmiv.download.MotuProAudio</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>purge_destination</key>
					<true/>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/MOTU_Pro_Audio_Drivers.pkg/payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>purge_destination</key>
					<false/>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/MOTU/ProAudio/MOTUProAudioHTTPServer.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
						<key>installs</key>
						<array>
							<dict>
								<key>CFBundleIdentifier</key>
								<string>com.motu.MOTUProAudioHTTPServer</string>
								<key>CFBundleShortVersionString</key>
								<string>%version%</string>
								<key>path</key>
								<string>/Library/Application Support/MOTU/ProAudio/MOTUProAudioHTTPServer.app</string>
								<key>type</key>
								<string>application</string>
								<key>version_comparison_key</key>
								<string>CFBundleShortVersionString</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Comment</key>
				<string>Tidy-up unpacked contents.</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
						<string>%RECIPE_CACHE_DIR%/payload</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
