<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Written by James Carpenter</string>
	<key>Description</key>
	<string>Downloads the latest versions of MOTU AVB driver and MOTU Audio Tools and imports them into Munki.</string>
	<key>Identifier</key>
	<string>uk.ac.bham.beast.autopkg.munki.MotuAVB</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>MotuAVB</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Includes MOTU Discovery (for AVB interfaces) and MOTU Audio Tools (for signal analysis).</string>
			<key>developer</key>
			<string>MOTU</string>
			<key>display_name</key>
			<string>MOTU AVB</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>uk.ac.bham.beast.autopkg.download.MotuAVB</string>
	<key>Process</key>
	<array>
    <dict>
      <key>Processor</key>
      <string>FileFinder</string>
			<key>Arguments</key>
			<dict>
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/*/MOTU*.*pkg</string>
      </dict>
    </dict>
    <!-- <dict>
      <key>Processor</key>
      <string>DmgCreator</string>
      <key>Arguments</key>
      <dict>
          <key>dmg_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/MOTU Pro Audio Installer for Mac</string>
          <key>dmg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
      </dict>
    </dict> -->
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
        <!-- <string>%dmg_path%</string> -->
        <string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
