<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of the Sennheiser Ambeo plugin and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.orbsmiv.munki.LilyPond</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>LilyPond</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>LilyPond is a music engraving program, devoted to producing the highest-quality sheet music possible. It brings the aesthetics of traditionally engraved music to computer printouts.</string>
				<key>display_name</key>
				<string>LilyPond</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>ParentRecipe</key>
		<string>com.github.orbsmiv.pkg.LilyPond</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>flat_pkg_path</key>
					<string>%pkg_path%</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>installs_item_paths</key>
					<array>
						<string>/Applications/LilyPond.app</string>
					</array>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
						<string>%RECIPE_CACHE_DIR%/payload</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
