<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of LilyPond.</string>
		<key>Identifier</key>
		<string>com.github.orbsmiv.pkg.LilyPond</string>
		<key>Input</key>
		<dict>
			<key>DOWNLOAD_URL</key>
			<string>http://lilypond.org/macos-x.html</string>
			<key>NAME</key>
			<string>LilyPond</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>ParentRecipe</key>
		<string>com.github.orbsmiv.download.LilyPond</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/expanded</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/expanded/*.app/Contents/Info.plist</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%found_filename%</string>
					<key>output_plist_path</key>
					<string>%found_filename%</string>
					<key>plist_data</key>
					<dict>
						<key>CFBundleShortVersionString</key>
						<string>%version%</string>
						<key>CFBundleVersion</key>
						<string>%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PlistEditor</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>app_path</key>
					<string>%RECIPE_CACHE_DIR%/expanded/*.app</string>
					<key>force_pkg_build</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Comment</key>
				<string>Clean-up working directory.</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/expanded</string>
						<string>%RECIPE_CACHE_DIR%/payload</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
